notes/my-paper-workflow.org
#+title: my-paper-workflow
#+author: liangzid
#+FILETAGS: noshow, 
#+date: Fri Sep 10 11:36:19 2021
#+email: 2273067585@qq.com 

接触科研已有一年光阴，形成了自己的初版工作流，现记录如下。

please see draw picture in:

please see org mode in:


* 写作工具
如下表所示，目前的工具流程是VISIO画图，emacs+latex+WSL2+Mobaxterm 进行论文撰写，emacs ispell + GNU apell进行拼写检查，grammerly进行语法层面的检查，github用于版本控制，overleaf进行上传和分享给老师。

|----------------------+-----------+---------------------------------------------|
| 论文写作任务         | 工具      | 介绍                                        |
|----------------------+-----------+---------------------------------------------|
| 画图                 | visio     | in window10，学校官网自带                   |
| 论文撰写             | emacs     | 工作环境：win10，emacs in WSL2，ubuntu20.04 |
|                      |           | 查看：使用evience进行pdf查看，in WSL2       |
|                      |           | UI：使用Mobaxterm自带的xserver启动emacs     |
|                      |           | 撰写：cdlatex+auctex+reftex+company         |
|                      |           | 补全：用English-helper做单词自动补全        |
|                      |           | 拼写检查：ispell，aspell                    |
| 版本控制             | gitee     | 私有仓库                                    |
| 语法检查             | grammerly | 只使用免费功能，太菜了                      |
| 分享，请老师帮忙评阅 | overleaf  | 通过分享链接的形式进行                      |
| 翻译                 | [[https://www.deepl.com/translator][deepl]]     | 有些单词，或者表述，可以查询借鉴            |
|----------------------+-----------+---------------------------------------------|



* 论文写作流程
** 写作顺序
遵循以下原则中的若干条：
1. 在整体的写作模式上，可以边做边写，也可以做完了再写，也可以一边做一边写。 一般而言，实验做得厌倦了开始写一些东西是比较合适的。
2. 按照老师的指示，论文写作是 *“模仿”* 而非创作，一定要多多借鉴别人。 最好是自己在写论文时，打开一篇别人的论文工作，照着他们的语气和逻辑去补充自己的。实验怎么写，introduction怎么写，our method怎么写，都是如此。
3. 按照老师的指示，应当慢写而非快写。最好是一个小部分的论文写一大段时间，精心改好，省得来回折腾。
4. 按照老师的指示，introduction和abstract最后写，our method和experiment先写，related works相对比较独立。

上述四点中，我对第二点体会比较深，对第4点有一定的感觉，第一点或许也很重要，第三点还没有彻底领悟。目前受限于个人的水平和性格，第三点贯彻得不是很好。






  


  