my-paper-workflow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-15 Mon 19:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>我的学术学习工作流</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liangzid" />
</head>
<body>
<div id="content">
<h1 class="title">我的学术学习工作流</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3814a10">写作工具</a></li>
<li><a href="#org7a6909c">论文写作流程</a>
<ul>
<li><a href="#orgad7d387">写作顺序</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
接触科研已有一年光阴，形成了自己的初版工作流，现记录如下。
</p>

<p>
please see draw picture in:
</p>

<p>
please see org mode in:
</p>


<div id="outline-container-org3814a10" class="outline-2">
<h2 id="org3814a10">写作工具</h2>
<div class="outline-text-2" id="text-org3814a10">
<p>
如下表所示，目前的工具流程是VISIO画图，emacs+latex+WSL2+Mobaxterm 进行论文撰写，emacs ispell + GNU apell进行拼写检查，grammerly进行语法层面的检查，github用于版本控制，overleaf进行上传和分享给老师。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">论文写作任务</th>
<th scope="col" class="org-left">工具</th>
<th scope="col" class="org-left">介绍</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">画图</td>
<td class="org-left">visio</td>
<td class="org-left">in window10，学校官网自带</td>
</tr>

<tr>
<td class="org-left">论文撰写</td>
<td class="org-left">emacs</td>
<td class="org-left">工作环境：win10，emacs in WSL2，ubuntu20.04</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">查看：使用evience进行pdf查看，in WSL2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">UI：使用Mobaxterm自带的xserver启动emacs</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">撰写：cdlatex+auctex+reftex+company</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">补全：用English-helper做单词自动补全</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">拼写检查：ispell，aspell</td>
</tr>

<tr>
<td class="org-left">版本控制</td>
<td class="org-left">gitee</td>
<td class="org-left">私有仓库</td>
</tr>

<tr>
<td class="org-left">语法检查</td>
<td class="org-left">grammerly</td>
<td class="org-left">只使用免费功能，太菜了</td>
</tr>

<tr>
<td class="org-left">分享，请老师帮忙评阅</td>
<td class="org-left">overleaf</td>
<td class="org-left">通过分享链接的形式进行</td>
</tr>

<tr>
<td class="org-left">翻译</td>
<td class="org-left"><a href="https://www.deepl.com/translator">deepl</a></td>
<td class="org-left">有些单词，或者表述，可以查询借鉴</td>
</tr>
</tbody>
</table>
</div>
</div>



<div id="outline-container-org7a6909c" class="outline-2">
<h2 id="org7a6909c">论文写作流程</h2>
<div class="outline-text-2" id="text-org7a6909c">
</div>
<div id="outline-container-orgad7d387" class="outline-3">
<h3 id="orgad7d387">写作顺序</h3>
<div class="outline-text-3" id="text-orgad7d387">
<p>
遵循以下原则中的若干条：
</p>
<ol class="org-ol">
<li>在整体的写作模式上，可以边做边写，也可以做完了再写，也可以一边做一边写。 一般而言，实验做得厌倦了开始写一些东西是比较合适的。</li>
<li>按照老师的指示，论文写作是 <b>“模仿”</b> 而非创作，一定要多多借鉴别人。 最好是自己在写论文时，打开一篇别人的论文工作，照着他们的语气和逻辑去补充自己的。实验怎么写，introduction怎么写，our method怎么写，都是如此。</li>
<li>按照老师的指示，应当慢写而非快写。最好是一个小部分的论文写一大段时间，精心改好，省得来回折腾。</li>
<li>按照老师的指示，introduction和abstract最后写，our method和experiment先写，related works相对比较独立。</li>
</ol>

<p>
上述四点中，我对第二点体会比较深，对第4点有一定的感觉，第一点或许也很重要，第三点还没有彻底领悟。目前受限于个人的水平和性格，第三点贯彻得不是很好。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Fri Sep 10 11:36:19 2021</p>
<p class="author">Author: liangzid</p>
<p class="date">Created: 2021-11-15 Mon 19:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
